# DividedSurfacePatternRotationAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfacePatternRotationAngle Property
ParameterTypeId Class See Also
---
"Component Rotation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfacePatternRotationAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfacePatternRotationAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfacePatternRotationAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace